Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/adc.h
/* -------- ADC_IDR : (ADC Offset: 0x28) ( /W 32) Interrupt Disable Register -------- */
#define ADC_IDR_EOC0_Pos                      _U_(0)                                               /**< (ADC_IDR) End of Conversion Interrupt Disable 0 Position */
#define ADC_IDR_EOC0_Msk                      (_U_(0x1) << ADC_IDR_EOC0_Pos)                       /**< (ADC_IDR) End of Conversion Interrupt Disable 0 Mask */
#define ADC_IDR_EOC0(value)                   (ADC_IDR_EOC0_Msk & ((value) << ADC_IDR_EOC0_Pos))  
#define ADC_IDR_EOC1_Pos                      _U_(1)                                               /**< (ADC_IDR) End of Conversion Interrupt Disable 1 Position */
#define ADC_IDR_EOC1_Msk                      (_U_(0x1) << ADC_IDR_EOC1_Pos)                       /**< (ADC_IDR) End of Conversion Interrupt Disable 1 Mask */
#define ADC_IDR_EOC1(value)                   (ADC_IDR_EOC1_Msk & ((value) << ADC_IDR_EOC1_Pos))  
#define ADC_IDR_EOC2_Pos                      _U_(2)                                               /**< (ADC_IDR) End of Conversion Interrupt Disable 2 Position */
#define ADC_IDR_EOC2_Msk                      (_U_(0x1) << ADC_IDR_EOC2_Pos)                       /**< (ADC_IDR) End of Conversion Interrupt Disable 2 Mask */
#define ADC_IDR_EOC2(value)                   (ADC_IDR_EOC2_Msk & ((value) << ADC_IDR_EOC2_Pos))  
#define ADC_IDR_EOC3_Pos                      _U_(3)                                               /**< (ADC_IDR) End of Conversion Interrupt Disable 3 Position */
#define ADC_IDR_EOC3_Msk                      (_U_(0x1) << ADC_IDR_EOC3_Pos)                       /**< (ADC_IDR) End of Conversion Interrupt Disable 3 Mask */
#define ADC_IDR_EOC3(value)                   (ADC_IDR_EOC3_Msk & ((value) << ADC_IDR_EOC3_Pos))  
#define ADC_IDR_EOC4_Pos                      _U_(4)                                               /**< (ADC_IDR) End of Conversion Interrupt Disable 4 Position */
#define ADC_IDR_EOC4_Msk                      (_U_(0x1) << ADC_IDR_EOC4_Pos)                       /**< (ADC_IDR) End of Conversion Interrupt Disable 4 Mask */
#define ADC_IDR_EOC4(value)                   (ADC_IDR_EOC4_Msk & ((value) << ADC_IDR_EOC4_Pos))  
#define ADC_IDR_EOC5_Pos                      _U_(5)                                               /**< (ADC_IDR) End of Conversion Interrupt Disable 5 Position */
#define ADC_IDR_EOC5_Msk                      (_U_(0x1) << ADC_IDR_EOC5_Pos)                       /**< (ADC_IDR) End of Conversion Interrupt Disable 5 Mask */
#define ADC_IDR_EOC5(value)                   (ADC_IDR_EOC5_Msk & ((value) << ADC_IDR_EOC5_Pos))  
#define ADC_IDR_EOC6_Pos                      _U_(6)                                               /**< (ADC_IDR) End of Conversion Interrupt Disable 6 Position */
#define ADC_IDR_EOC6_Msk                      (_U_(0x1) << ADC_IDR_EOC6_Pos)                       /**< (ADC_IDR) End of Conversion Interrupt Disable 6 Mask */
#define ADC_IDR_EOC6(value)                   (ADC_IDR_EOC6_Msk & ((value) << ADC_IDR_EOC6_Pos))  
#define ADC_IDR_EOC7_Pos                      _U_(7)                                               /**< (ADC_IDR) End of Conversion Interrupt Disable 7 Position */
#define ADC_IDR_EOC7_Msk                      (_U_(0x1) << ADC_IDR_EOC7_Pos)                       /**< (ADC_IDR) End of Conversion Interrupt Disable 7 Mask */
#define ADC_IDR_EOC7(value)                   (ADC_IDR_EOC7_Msk & ((value) << ADC_IDR_EOC7_Pos))  
#define ADC_IDR_EOC8_Pos                      _U_(8)                                               /**< (ADC_IDR) End of Conversion Interrupt Disable 8 Position */
#define ADC_IDR_EOC8_Msk                      (_U_(0x1) << ADC_IDR_EOC8_Pos)                       /**< (ADC_IDR) End of Conversion Interrupt Disable 8 Mask */
#define ADC_IDR_EOC8(value)                   (ADC_IDR_EOC8_Msk & ((value) << ADC_IDR_EOC8_Pos))  
#define ADC_IDR_EOC9_Pos                      _U_(9)                                               /**< (ADC_IDR) End of Conversion Interrupt Disable 9 Position */
#define ADC_IDR_EOC9_Msk                      (_U_(0x1) << ADC_IDR_EOC9_Pos)                       /**< (ADC_IDR) End of Conversion Interrupt Disable 9 Mask */
#define ADC_IDR_EOC9(value)                   (ADC_IDR_EOC9_Msk & ((value) << ADC_IDR_EOC9_Pos))  
#define ADC_IDR_EOC10_Pos                     _U_(10)                                              /**< (ADC_IDR) End of Conversion Interrupt Disable 10 Position */
#define ADC_IDR_EOC10_Msk                     (_U_(0x1) << ADC_IDR_EOC10_Pos)                      /**< (ADC_IDR) End of Conversion Interrupt Disable 10 Mask */
#define ADC_IDR_EOC10(value)                  (ADC_IDR_EOC10_Msk & ((value) << ADC_IDR_EOC10_Pos))
#define ADC_IDR_EOC11_Pos                     _U_(11)                                              /**< (ADC_IDR) End of Conversion Interrupt Disable 11 Position */
#define ADC_IDR_EOC11_Msk                     (_U_(0x1) << ADC_IDR_EOC11_Pos)                      /**< (ADC_IDR) End of Conversion Interrupt Disable 11 Mask */
#define ADC_IDR_EOC11(value)                  (ADC_IDR_EOC11_Msk & ((value) << ADC_IDR_EOC11_Pos))
#define ADC_IDR_LCCHG_Pos                     _U_(19)                                              /**< (ADC_IDR) Last Channel Change Interrupt Disable Position */
#define ADC_IDR_LCCHG_Msk                     (_U_(0x1) << ADC_IDR_LCCHG_Pos)                      /**< (ADC_IDR) Last Channel Change Interrupt Disable Mask */
#define ADC_IDR_LCCHG(value)                  (ADC_IDR_LCCHG_Msk & ((value) << ADC_IDR_LCCHG_Pos))
#define ADC_IDR_XRDY_Pos                      _U_(20)                                              /**< (ADC_IDR) Touchscreen Measure XPOS Ready Interrupt Disable Position */
#define ADC_IDR_XRDY_Msk                      (_U_(0x1) << ADC_IDR_XRDY_Pos)                       /**< (ADC_IDR) Touchscreen Measure XPOS Ready Interrupt Disable Mask */
#define ADC_IDR_XRDY(value)                   (ADC_IDR_XRDY_Msk & ((value) << ADC_IDR_XRDY_Pos))  
#define ADC_IDR_YRDY_Pos                      _U_(21)                                              /**< (ADC_IDR) Touchscreen Measure YPOS Ready Interrupt Disable Position */
#define ADC_IDR_YRDY_Msk                      (_U_(0x1) << ADC_IDR_YRDY_Pos)                       /**< (ADC_IDR) Touchscreen Measure YPOS Ready Interrupt Disable Mask */
#define ADC_IDR_YRDY(value)                   (ADC_IDR_YRDY_Msk & ((value) << ADC_IDR_YRDY_Pos))  
#define ADC_IDR_PRDY_Pos                      _U_(22)                                              /**< (ADC_IDR) Touchscreen Measure Pressure Ready Interrupt Disable Position */
#define ADC_IDR_PRDY_Msk                      (_U_(0x1) << ADC_IDR_PRDY_Pos)                       /**< (ADC_IDR) Touchscreen Measure Pressure Ready Interrupt Disable Mask */
#define ADC_IDR_PRDY(value)                   (ADC_IDR_PRDY_Msk & ((value) << ADC_IDR_PRDY_Pos))  
#define ADC_IDR_DRDY_Pos                      _U_(24)                                              /**< (ADC_IDR) Data Ready Interrupt Disable Position */
#define ADC_IDR_DRDY_Msk                      (_U_(0x1) << ADC_IDR_DRDY_Pos)                       /**< (ADC_IDR) Data Ready Interrupt Disable Mask */
#define ADC_IDR_DRDY(value)                   (ADC_IDR_DRDY_Msk & ((value) << ADC_IDR_DRDY_Pos))  
#define ADC_IDR_GOVRE_Pos                     _U_(25)                                              /**< (ADC_IDR) General Overrun Error Interrupt Disable Position */
#define ADC_IDR_GOVRE_Msk                     (_U_(0x1) << ADC_IDR_GOVRE_Pos)                      /**< (ADC_IDR) General Overrun Error Interrupt Disable Mask */
#define ADC_IDR_GOVRE(value)                  (ADC_IDR_GOVRE_Msk & ((value) << ADC_IDR_GOVRE_Pos))
#define ADC_IDR_COMPE_Pos                     _U_(26)                                              /**< (ADC_IDR) Comparison Event Interrupt Disable Position */
#define ADC_IDR_COMPE_Msk                     (_U_(0x1) << ADC_IDR_COMPE_Pos)                      /**< (ADC_IDR) Comparison Event Interrupt Disable Mask */
#define ADC_IDR_COMPE(value)                  (ADC_IDR_COMPE_Msk & ((value) << ADC_IDR_COMPE_Pos))
#define ADC_IDR_PEN_Pos                       _U_(29)                                              /**< (ADC_IDR) Pen Contact Interrupt Disable Position */
#define ADC_IDR_PEN_Msk                       (_U_(0x1) << ADC_IDR_PEN_Pos)                        /**< (ADC_IDR) Pen Contact Interrupt Disable Mask */
#define ADC_IDR_PEN(value)                    (ADC_IDR_PEN_Msk & ((value) << ADC_IDR_PEN_Pos))    
#define ADC_IDR_NOPEN_Pos                     _U_(30)                                              /**< (ADC_IDR) No Pen Contact Interrupt Disable Position */
#define ADC_IDR_NOPEN_Msk                     (_U_(0x1) << ADC_IDR_NOPEN_Pos)                      /**< (ADC_IDR) No Pen Contact Interrupt Disable Mask */
#define ADC_IDR_NOPEN(value)                  (ADC_IDR_NOPEN_Msk & ((value) << ADC_IDR_NOPEN_Pos))
#define ADC_IDR_Msk                           _U_(0x67780FFF)                                      /**< (ADC_IDR) Register Mask  */

