Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/adc.h
/* -------- ADC_PDR : (ADC Offset: 0xA0) (R/W 32) Pseudo-Differential Register -------- */
#define ADC_PDR_PDIFF0_Pos                    _U_(0)                                               /**< (ADC_PDR) Pseudo-Differential Inputs for Channel 0 Position */
#define ADC_PDR_PDIFF0_Msk                    (_U_(0x1) << ADC_PDR_PDIFF0_Pos)                     /**< (ADC_PDR) Pseudo-Differential Inputs for Channel 0 Mask */
#define ADC_PDR_PDIFF0(value)                 (ADC_PDR_PDIFF0_Msk & ((value) << ADC_PDR_PDIFF0_Pos))
#define ADC_PDR_PDIFF1_Pos                    _U_(1)                                               /**< (ADC_PDR) Pseudo-Differential Inputs for Channel 1 Position */
#define ADC_PDR_PDIFF1_Msk                    (_U_(0x1) << ADC_PDR_PDIFF1_Pos)                     /**< (ADC_PDR) Pseudo-Differential Inputs for Channel 1 Mask */
#define ADC_PDR_PDIFF1(value)                 (ADC_PDR_PDIFF1_Msk & ((value) << ADC_PDR_PDIFF1_Pos))
#define ADC_PDR_PDIFF2_Pos                    _U_(2)                                               /**< (ADC_PDR) Pseudo-Differential Inputs for Channel 2 Position */
#define ADC_PDR_PDIFF2_Msk                    (_U_(0x1) << ADC_PDR_PDIFF2_Pos)                     /**< (ADC_PDR) Pseudo-Differential Inputs for Channel 2 Mask */
#define ADC_PDR_PDIFF2(value)                 (ADC_PDR_PDIFF2_Msk & ((value) << ADC_PDR_PDIFF2_Pos))
#define ADC_PDR_PDIFF3_Pos                    _U_(3)                                               /**< (ADC_PDR) Pseudo-Differential Inputs for Channel 3 Position */
#define ADC_PDR_PDIFF3_Msk                    (_U_(0x1) << ADC_PDR_PDIFF3_Pos)                     /**< (ADC_PDR) Pseudo-Differential Inputs for Channel 3 Mask */
#define ADC_PDR_PDIFF3(value)                 (ADC_PDR_PDIFF3_Msk & ((value) << ADC_PDR_PDIFF3_Pos))
#define ADC_PDR_PDIFF4_Pos                    _U_(4)                                               /**< (ADC_PDR) Pseudo-Differential Inputs for Channel 4 Position */
#define ADC_PDR_PDIFF4_Msk                    (_U_(0x1) << ADC_PDR_PDIFF4_Pos)                     /**< (ADC_PDR) Pseudo-Differential Inputs for Channel 4 Mask */
#define ADC_PDR_PDIFF4(value)                 (ADC_PDR_PDIFF4_Msk & ((value) << ADC_PDR_PDIFF4_Pos))
#define ADC_PDR_PDIFF5_Pos                    _U_(5)                                               /**< (ADC_PDR) Pseudo-Differential Inputs for Channel 5 Position */
#define ADC_PDR_PDIFF5_Msk                    (_U_(0x1) << ADC_PDR_PDIFF5_Pos)                     /**< (ADC_PDR) Pseudo-Differential Inputs for Channel 5 Mask */
#define ADC_PDR_PDIFF5(value)                 (ADC_PDR_PDIFF5_Msk & ((value) << ADC_PDR_PDIFF5_Pos))
#define ADC_PDR_PDIFF6_Pos                    _U_(6)                                               /**< (ADC_PDR) Pseudo-Differential Inputs for Channel 6 Position */
#define ADC_PDR_PDIFF6_Msk                    (_U_(0x1) << ADC_PDR_PDIFF6_Pos)                     /**< (ADC_PDR) Pseudo-Differential Inputs for Channel 6 Mask */
#define ADC_PDR_PDIFF6(value)                 (ADC_PDR_PDIFF6_Msk & ((value) << ADC_PDR_PDIFF6_Pos))
#define ADC_PDR_PDIFF7_Pos                    _U_(7)                                               /**< (ADC_PDR) Pseudo-Differential Inputs for Channel 7 Position */
#define ADC_PDR_PDIFF7_Msk                    (_U_(0x1) << ADC_PDR_PDIFF7_Pos)                     /**< (ADC_PDR) Pseudo-Differential Inputs for Channel 7 Mask */
#define ADC_PDR_PDIFF7(value)                 (ADC_PDR_PDIFF7_Msk & ((value) << ADC_PDR_PDIFF7_Pos))
#define ADC_PDR_PDIFF8_Pos                    _U_(8)                                               /**< (ADC_PDR) Pseudo-Differential Inputs for Channel 8 Position */
#define ADC_PDR_PDIFF8_Msk                    (_U_(0x1) << ADC_PDR_PDIFF8_Pos)                     /**< (ADC_PDR) Pseudo-Differential Inputs for Channel 8 Mask */
#define ADC_PDR_PDIFF8(value)                 (ADC_PDR_PDIFF8_Msk & ((value) << ADC_PDR_PDIFF8_Pos))
#define ADC_PDR_PDIFF9_Pos                    _U_(9)                                               /**< (ADC_PDR) Pseudo-Differential Inputs for Channel 9 Position */
#define ADC_PDR_PDIFF9_Msk                    (_U_(0x1) << ADC_PDR_PDIFF9_Pos)                     /**< (ADC_PDR) Pseudo-Differential Inputs for Channel 9 Mask */
#define ADC_PDR_PDIFF9(value)                 (ADC_PDR_PDIFF9_Msk & ((value) << ADC_PDR_PDIFF9_Pos))
#define ADC_PDR_PDIFF10_Pos                   _U_(10)                                              /**< (ADC_PDR) Pseudo-Differential Inputs for Channel 10 Position */
#define ADC_PDR_PDIFF10_Msk                   (_U_(0x1) << ADC_PDR_PDIFF10_Pos)                    /**< (ADC_PDR) Pseudo-Differential Inputs for Channel 10 Mask */
#define ADC_PDR_PDIFF10(value)                (ADC_PDR_PDIFF10_Msk & ((value) << ADC_PDR_PDIFF10_Pos))
#define ADC_PDR_PDIFF11_Pos                   _U_(11)                                              /**< (ADC_PDR) Pseudo-Differential Inputs for Channel 11 Position */
#define ADC_PDR_PDIFF11_Msk                   (_U_(0x1) << ADC_PDR_PDIFF11_Pos)                    /**< (ADC_PDR) Pseudo-Differential Inputs for Channel 11 Mask */
#define ADC_PDR_PDIFF11(value)                (ADC_PDR_PDIFF11_Msk & ((value) << ADC_PDR_PDIFF11_Pos))
#define ADC_PDR_PDIFF12_Pos                   _U_(12)                                              /**< (ADC_PDR) Pseudo-Differential Inputs for Channel 12 Position */
#define ADC_PDR_PDIFF12_Msk                   (_U_(0x1) << ADC_PDR_PDIFF12_Pos)                    /**< (ADC_PDR) Pseudo-Differential Inputs for Channel 12 Mask */
#define ADC_PDR_PDIFF12(value)                (ADC_PDR_PDIFF12_Msk & ((value) << ADC_PDR_PDIFF12_Pos))
#define ADC_PDR_PDIFF13_Pos                   _U_(13)                                              /**< (ADC_PDR) Pseudo-Differential Inputs for Channel 13 Position */
#define ADC_PDR_PDIFF13_Msk                   (_U_(0x1) << ADC_PDR_PDIFF13_Pos)                    /**< (ADC_PDR) Pseudo-Differential Inputs for Channel 13 Mask */
#define ADC_PDR_PDIFF13(value)                (ADC_PDR_PDIFF13_Msk & ((value) << ADC_PDR_PDIFF13_Pos))
#define ADC_PDR_PDIFF14_Pos                   _U_(14)                                              /**< (ADC_PDR) Pseudo-Differential Inputs for Channel 14 Position */
#define ADC_PDR_PDIFF14_Msk                   (_U_(0x1) << ADC_PDR_PDIFF14_Pos)                    /**< (ADC_PDR) Pseudo-Differential Inputs for Channel 14 Mask */
#define ADC_PDR_PDIFF14(value)                (ADC_PDR_PDIFF14_Msk & ((value) << ADC_PDR_PDIFF14_Pos))
#define ADC_PDR_PDIFF15_Pos                   _U_(15)                                              /**< (ADC_PDR) Pseudo-Differential Inputs for Channel 15 Position */
#define ADC_PDR_PDIFF15_Msk                   (_U_(0x1) << ADC_PDR_PDIFF15_Pos)                    /**< (ADC_PDR) Pseudo-Differential Inputs for Channel 15 Mask */
#define ADC_PDR_PDIFF15(value)                (ADC_PDR_PDIFF15_Msk & ((value) << ADC_PDR_PDIFF15_Pos))
#define ADC_PDR_Msk                           _U_(0x0000FFFF)                                      /**< (ADC_PDR) Register Mask  */

#define ADC_PDR_PDIFF_Pos                     _U_(0)                                               /**< (ADC_PDR Position) Pseudo-Differential Inputs for Channel x5 */
#define ADC_PDR_PDIFF_Msk                     (_U_(0xFFFF) << ADC_PDR_PDIFF_Pos)                   /**< (ADC_PDR Mask) PDIFF */
#define ADC_PDR_PDIFF(value)                  (ADC_PDR_PDIFF_Msk & ((value) << ADC_PDR_PDIFF_Pos)) 

/* -------- ADC_TSMR : (ADC Offset: 0xB0) (R/W 32) Touchscreen Mode Register -------- */
#define ADC_TSMR_TSMODE_Pos                   _U_(0)                                               /**< (ADC_TSMR) Touchscreen Mode Position */
#define ADC_TSMR_TSMODE_Msk                   (_U_(0x3) << ADC_TSMR_TSMODE_Pos)                    /**< (ADC_TSMR) Touchscreen Mode Mask */
#define ADC_TSMR_TSMODE(value)                (ADC_TSMR_TSMODE_Msk & ((value) << ADC_TSMR_TSMODE_Pos))
#define   ADC_TSMR_TSMODE_NONE_Val            _U_(0x0)                                             /**< (ADC_TSMR) No Touchscreen  */
#define   ADC_TSMR_TSMODE_4_WIRE_NO_PM_Val    _U_(0x1)                                             /**< (ADC_TSMR) 4-wire Touchscreen without pressure measurement  */
#define   ADC_TSMR_TSMODE_4_WIRE_Val          _U_(0x2)                                             /**< (ADC_TSMR) 4-wire Touchscreen with pressure measurement  */
#define   ADC_TSMR_TSMODE_5_WIRE_Val          _U_(0x3)                                             /**< (ADC_TSMR) 5-wire Touchscreen  */
#define ADC_TSMR_TSMODE_NONE                  (ADC_TSMR_TSMODE_NONE_Val << ADC_TSMR_TSMODE_Pos)    /**< (ADC_TSMR) No Touchscreen Position  */
#define ADC_TSMR_TSMODE_4_WIRE_NO_PM          (ADC_TSMR_TSMODE_4_WIRE_NO_PM_Val << ADC_TSMR_TSMODE_Pos) /**< (ADC_TSMR) 4-wire Touchscreen without pressure measurement Position  */
#define ADC_TSMR_TSMODE_4_WIRE                (ADC_TSMR_TSMODE_4_WIRE_Val << ADC_TSMR_TSMODE_Pos)  /**< (ADC_TSMR) 4-wire Touchscreen with pressure measurement Position  */
#define ADC_TSMR_TSMODE_5_WIRE                (ADC_TSMR_TSMODE_5_WIRE_Val << ADC_TSMR_TSMODE_Pos)  /**< (ADC_TSMR) 5-wire Touchscreen Position  */
#define ADC_TSMR_TSAV_Pos                     _U_(4)                                               /**< (ADC_TSMR) Touchscreen Average Position */
#define ADC_TSMR_TSAV_Msk                     (_U_(0x3) << ADC_TSMR_TSAV_Pos)                      /**< (ADC_TSMR) Touchscreen Average Mask */
#define ADC_TSMR_TSAV(value)                  (ADC_TSMR_TSAV_Msk & ((value) << ADC_TSMR_TSAV_Pos))
#define   ADC_TSMR_TSAV_NO_FILTER_Val         _U_(0x0)                                             /**< (ADC_TSMR) No Filtering. Only one ADC conversion per measure  */
#define   ADC_TSMR_TSAV_AVG2CONV_Val          _U_(0x1)                                             /**< (ADC_TSMR) Averages 2 ADC conversions  */
#define   ADC_TSMR_TSAV_AVG4CONV_Val          _U_(0x2)                                             /**< (ADC_TSMR) Averages 4 ADC conversions  */
#define   ADC_TSMR_TSAV_AVG8CONV_Val          _U_(0x3)                                             /**< (ADC_TSMR) Averages 8 ADC conversions  */
#define ADC_TSMR_TSAV_NO_FILTER               (ADC_TSMR_TSAV_NO_FILTER_Val << ADC_TSMR_TSAV_Pos)   /**< (ADC_TSMR) No Filtering. Only one ADC conversion per measure Position  */
#define ADC_TSMR_TSAV_AVG2CONV                (ADC_TSMR_TSAV_AVG2CONV_Val << ADC_TSMR_TSAV_Pos)    /**< (ADC_TSMR) Averages 2 ADC conversions Position  */
#define ADC_TSMR_TSAV_AVG4CONV                (ADC_TSMR_TSAV_AVG4CONV_Val << ADC_TSMR_TSAV_Pos)    /**< (ADC_TSMR) Averages 4 ADC conversions Position  */
#define ADC_TSMR_TSAV_AVG8CONV                (ADC_TSMR_TSAV_AVG8CONV_Val << ADC_TSMR_TSAV_Pos)    /**< (ADC_TSMR) Averages 8 ADC conversions Position  */
#define ADC_TSMR_TSFREQ_Pos                   _U_(8)                                               /**< (ADC_TSMR) Touchscreen Frequency Position */
#define ADC_TSMR_TSFREQ_Msk                   (_U_(0xF) << ADC_TSMR_TSFREQ_Pos)                    /**< (ADC_TSMR) Touchscreen Frequency Mask */
#define ADC_TSMR_TSFREQ(value)                (ADC_TSMR_TSFREQ_Msk & ((value) << ADC_TSMR_TSFREQ_Pos))
#define ADC_TSMR_TSSCTIM_Pos                  _U_(16)                                              /**< (ADC_TSMR) Touchscreen Switches Closure Time Position */
#define ADC_TSMR_TSSCTIM_Msk                  (_U_(0xF) << ADC_TSMR_TSSCTIM_Pos)                   /**< (ADC_TSMR) Touchscreen Switches Closure Time Mask */
#define ADC_TSMR_TSSCTIM(value)               (ADC_TSMR_TSSCTIM_Msk & ((value) << ADC_TSMR_TSSCTIM_Pos))
#define ADC_TSMR_NOTSDMA_Pos                  _U_(22)                                              /**< (ADC_TSMR) No TouchScreen DMA Position */
#define ADC_TSMR_NOTSDMA_Msk                  (_U_(0x1) << ADC_TSMR_NOTSDMA_Pos)                   /**< (ADC_TSMR) No TouchScreen DMA Mask */
#define ADC_TSMR_NOTSDMA(value)               (ADC_TSMR_NOTSDMA_Msk & ((value) << ADC_TSMR_NOTSDMA_Pos))
#define ADC_TSMR_PENDET_Pos                   _U_(24)                                              /**< (ADC_TSMR) Pen Contact Detection Enable Position */
#define ADC_TSMR_PENDET_Msk                   (_U_(0x1) << ADC_TSMR_PENDET_Pos)                    /**< (ADC_TSMR) Pen Contact Detection Enable Mask */
#define ADC_TSMR_PENDET(value)                (ADC_TSMR_PENDET_Msk & ((value) << ADC_TSMR_PENDET_Pos))
#define ADC_TSMR_PENDBC_Pos                   _U_(28)                                              /**< (ADC_TSMR) Pen Detect Debouncing Period Position */
#define ADC_TSMR_PENDBC_Msk                   (_U_(0xF) << ADC_TSMR_PENDBC_Pos)                    /**< (ADC_TSMR) Pen Detect Debouncing Period Mask */
#define ADC_TSMR_PENDBC(value)                (ADC_TSMR_PENDBC_Msk & ((value) << ADC_TSMR_PENDBC_Pos))
#define ADC_TSMR_Msk                          _U_(0xF14F0F33)                                      /**< (ADC_TSMR) Register Mask  */


/* -------- ADC_XPOSR : (ADC Offset: 0xB4) ( R/ 32) Touchscreen X Position Register -------- */
#define ADC_XPOSR_XPOS_Pos                    _U_(0)                                               /**< (ADC_XPOSR) X Position Position */
#define ADC_XPOSR_XPOS_Msk                    (_U_(0xFFF) << ADC_XPOSR_XPOS_Pos)                   /**< (ADC_XPOSR) X Position Mask */
#define ADC_XPOSR_XPOS(value)                 (ADC_XPOSR_XPOS_Msk & ((value) << ADC_XPOSR_XPOS_Pos))
#define ADC_XPOSR_XSCALE_Pos                  _U_(16)                                              /**< (ADC_XPOSR) Scale of XPOS Position */
#define ADC_XPOSR_XSCALE_Msk                  (_U_(0xFFF) << ADC_XPOSR_XSCALE_Pos)                 /**< (ADC_XPOSR) Scale of XPOS Mask */
#define ADC_XPOSR_XSCALE(value)               (ADC_XPOSR_XSCALE_Msk & ((value) << ADC_XPOSR_XSCALE_Pos))
#define ADC_XPOSR_Msk                         _U_(0x0FFF0FFF)                                      /**< (ADC_XPOSR) Register Mask  */


